<a href="https://colab.research.google.com/github/achingachris/datasciencelearninghub/blob/master/AfterWork_Data_Science_Data_Wrangling_with_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Data Wrangling with Python // Full Course

## Pre-requisites

In [1]:
# Pre-requisite 1
# ---
# The first thing that we will do in this notebook is 
# to import the pandas library for data manipulation.
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

In [2]:
# Pre-requisite 2
# ---
# We will also import the numpy library which
# will allow us to perform scientific computations.
# ---
# For those who are not familiar with what a library is,
# A library is a collection of related pieces of code that 
# have been compiled and stored together for reuse.
# ---
# OUR CODE GOES BELOW
# 
import numpy as np

## 1. Reading Data

In [3]:
# Example 1
# --- 
# Loading a dataset (csv file) from a url 
# ---
# Dataset url (csv file) = http://bit.ly/IrisDataset
# ---
# OUR CODE GOES BELOW
# 

# Reading our csv file from the given url and storing it to a dataframe.
# A data frame is a two-dimensional data structure that is used to 
# represent a table of data with rows and columns.
# ---
#
df = pd.read_csv("http://bit.ly/IrisDataset")

# Previewing the first 5 records
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [4]:
# Example 2
# ---
# We can also load A CSV Into pandas as shown below
# ---
# Dataset url = http://bit.ly/CitiesDataset1
# ----
# Instructions:
# 1. Visit the above dataset url with a browser. Then download the file.
# 2. Within this notebook you will need to have the Table of contents left sidebar open.
#    If its not open, you can open the sidebar clicking at the top of the notebook View -> Table of Contents.
# 3. Once its open click on the Files tab within the sidebar (this is on the farmost right).
# 4. Then upload the downloaded file to this location/ Or drag the file
# 5. Once uploaded you will use the name of the file to open the file as shown below. 
#    You can also store in a directory/folder then reference that directory while reading the file.
#    i.e. the file cities stored in a directory named finance, then the reference pd.read_csv("/finance/cities.csv")
# ---
# 

# Let's read the cities csv file
df_cities = pd.read_csv("cities.csv")

# Previewing the first five records
df_cities.head()

       city         country  latitude  longitude  temperature
0   Aalborg         Denmark     57.03       9.92         7.52
1  Aberdeen  United Kingdom     57.17      -2.08         8.10
2    Abisko          Sweden     63.35      18.83         0.20
3     Adana          Turkey     36.99      35.32        18.67
4  Albacete           Spain     39.00      -1.87        12.62

In [5]:
# Challenge 1a
# ---
# Question: Load the following hotels dataset and preview the first 5 records.
# Hint: Use a different dataframe than the one used in the example dataset 
#       i.e. using the dataframe name "hotel_df" rather using the dataframe name "df"
#       If you use the same dataframe names for the examples and challenges you 
#       might experience a crash.
#       We will be using this dataset for most of the challenges.
#     : To work quickly on theses challenges, copy paste example code and modify the your need. 
# ---
# Dataset url (csv file) = https://bit.ly/HotelBookingsDB
# This data set contains booking information for a city hotel and a resort hotel, 
# and includes information such as when the booking was made, length of stay, 
# the number of adults, children, and/or babies, and the number of available 
# parking spaces, among other things.
# ---
# OUR CODE GOES BELOW

hotel_df = pd.read_csv('hotel_bookings.csv')

hotel_df.head()

          hotel  is_canceled  ...  reservation_status  reservation_status_date
0  Resort Hotel            0  ...           Check-Out               2015-07-01
1  Resort Hotel            0  ...           Check-Out               2015-07-01
2  Resort Hotel            0  ...           Check-Out               2015-07-02
3  Resort Hotel            0  ...           Check-Out               2015-07-02
4  Resort Hotel            0  ...           Check-Out               2015-07-03

[5 rows x 32 columns]

In [8]:
# Challenge 1b
# ---
# Question: Load a dataset (excel file) from the url below
# Hint: - Use the read_excel() function rather than using the read_csv() function
#       - Use a new dataframe windmill_df
# ---
# Dataset url = http://bit.ly/WindmillDataset
# ---
# OUR CODE GOES BELOW
windmill_df = pd.read_excel('windmilldata.xlsx')
windmill_df.head()

  Windmill  Wind Speed (m/s)  Power output (MW)
0       a1          1.096875           0.000000
1       a2          1.231528           0.000000
2       a3          1.275139           0.005479
3       a4          1.365486           0.010104
4       a5          1.387778           0.010812

## 2. Data Exploration

In [9]:
# Example 2a
# ---
# Determining the no. of records in the dataset 
# NB: We will use the above loaded dataset in example 1
# ---
# OUR CODE GOES BELOW
#

# Shape returns no. or records/instances (left) and columns/variables (right)
#
df.shape

(150, 5)

In [11]:
# Challenge 2a
# ---
# Question: Determine the no. of records in the our hotels dataset.
# NB: last() gives us the last 5 records/instances
# ---  
# OUR CODE GOES BELOW
hotel_df.shape

(36553, 32)

In [12]:
# Example 2b
# ---
# Previewing the last few records/instances of our dataset
# ---
# OUR CODE GOES BELOW
#
df.tail()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [13]:
# Challenge 2c
# ---
# Question: Preview the last few records in the hotels dataset.
# Hint = Use the dataframe you created for this dataset. 
# ---
# OUR CODE GOES BELOW
#
hotel_df.tail()

              hotel  is_canceled  ...  reservation_status  reservation_status_date
36548  Resort Hotel            0  ...           Check-Out               2017-05-24
36549  Resort Hotel            0  ...           Check-Out               2017-05-24
36550  Resort Hotel            0  ...           Check-Out               2017-05-25
36551  Resort Hotel            0  ...           Check-Out               2017-05-24
36552  Resort Hotel            0  ...                 NaN                      NaN

[5 rows x 32 columns]

In [15]:
# Challenge 2d
# ---
# Question: Preview a sample of 10 records from the hotels dataset.
# Hint: Use the dataframe you created for this dataset. 
#     : Use the sample() function, and add no. of desired records as the parameter.
# ---
# OUR CODE GOES BELOW
#
hotel_df.sample(10)

              hotel  is_canceled  ...  reservation_status  reservation_status_date
31449  Resort Hotel            0  ...           Check-Out               2016-12-29
16789  Resort Hotel            0  ...           Check-Out               2015-09-12
23427  Resort Hotel            0  ...           Check-Out               2016-04-25
18365  Resort Hotel            1  ...            Canceled               2015-11-17
20631  Resort Hotel            0  ...           Check-Out               2016-02-05
14994  Resort Hotel            1  ...            Canceled               2015-04-28
18597  Resort Hotel            1  ...            Canceled               2015-11-24
5142   Resort Hotel            1  ...            Canceled               2016-03-18
22870  Resort Hotel            0  ...           Check-Out               2016-04-09
12584  Resort Hotel            1  ...            Canceled               2016-08-27

[10 rows x 32 columns]

In [16]:
# Example 2c
# ---
# Checking the datatypes of df variables (columns)
# --- 
# OUR CODE GOES BELOW
#
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [17]:
# Challenge 2e
# ---
# Question: Check the datatypes of the hotels dataset.
# ---
# OUR CODE GOES BELOW
# 
hotel_df.dtypes

hotel                              object
is_canceled                         int64
lead_time                           int64
arrival_date_year                   int64
arrival_date_month                 object
arrival_date_week_number            int64
arrival_date_day_of_month           int64
stays_in_weekend_nights             int64
stays_in_week_nights                int64
adults                              int64
children                            int64
babies                              int64
meal                               object
country                            object
market_segment                     object
distribution_channel               object
is_repeated_guest                   int64
previous_cancellations              int64
previous_bookings_not_canceled      int64
reserved_room_type                 object
assigned_room_type                 object
booking_changes                     int64
deposit_type                       object
agent                             float64
company                           float64
days_in_waiting_list              float64
customer_type                      object
adr                               float64
required_car_parking_spaces       float64
total_of_special_requests         float64
reservation_status                 object
reservation_status_date            object
dtype: object

## 3. Standardisation

#### <font color="blue">Examples</font>

In [18]:
# Example 1
# --- 
# Renaming column names
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# Reading our dataset from the url 
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset')
df.head()

  NAME;CITY;COUNTRY;HEIGHT;WEIGHT;ACCOUNT A;ACCOUNT B;TOTAL ACCOUNT
0  Adi Dako ;LISBON    ;PORTUGAL     ;56;132;2390...
1  John Paul;LONDON   ;UNITED KINGDOM;62;165;4500...
2     Cindy Jules;Stockholm;Sweden;48;117;;5504;8949
3      Arthur Kegels;BRUSSELS;BELGIUM;59;121;4344...
4  Freya Bismark;  Berlin;GERMANYY;53;126;7000;19...

In [19]:
# We specify the character ; as our separator so that we can 
# be able to ready the above file that has ";" as a separator 
# for our columns. We should note that many dataset may note have
# such a structure, but if we come across this kind of a scenario
# this is how we would read our file.
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [20]:
# Example 1a
# --- 
# We now rename our columns.
# We can use this method if we have many column names.
# We will use the str.strip(), str.lower(), str.replace() functions 
# to ensure that our column names are in lowercase format that we easily 
# reference while performing further analysis.
# ---
# str.strip() - This fuction is used to remove leading and trailing characters.
# str.lower() - This function is used to convert all characters to lowercase
# str.replace() - This fuction is used to replace text with some other text.
# ---
#
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

# Then preview our resulting dataframe
# ---
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [21]:
# Example 1b
# ---
# Alternatively, we can rename column names in a dataframe manually by 
# specifying new column names that would replace the original column names.
# You should note that this method is cumbersome when 
# the no. of features/varibles/columns become large.
# ---
#

# To demonstrate this, we will need to import our dataset again 
# so that we work with our original dataset. 
# ---
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';') 

# We then specify our columns names, store them in a list, then afterwards
# assign this list to the original column names. 

# Lets first see our original column names below
# ---
# 
df.columns

Index(['NAME', 'CITY', 'COUNTRY', 'HEIGHT', 'WEIGHT', 'ACCOUNT A', 'ACCOUNT B',
       'TOTAL ACCOUNT'],
      dtype='object')

In [22]:
# We then perform our column values replacement as shown below
# ---
# 
df.columns = ['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b', 'total_account']

# We then preview our dataframe as shown 
# ---
#
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [23]:
# Example 2
# ---
# We can also perform string conversion to a particular column. 
# This allows us to have uniformity across all values of a column.
# In this example, we will convert the values of the column "city" to lower case values.
# ---
# OUR CODE GOES BELOW
# 

# Lets convert the city column to comprise of only lowercase characters
# ---
# 
df['city'] = df['city'].str.lower()
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

In [24]:
# Example 3
# ---
# We can also perform types of conversion that we would want i.e. metric conversion.
# In this example, we will convert our height values to centimeters noting 
# that 1 inch = 2.54 cm.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# 

# We can perform our conversion across the column that we would want 
# then replace the column with the outcome of our conversion.
# ---
#
df['height'] = df['height'] * 2.54
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

In [25]:
# Example 4
# ---
# We can also perform other types of conversion such as datatype conversion as shown
# in the next cell.
# ---


# But before we do that, let's first determine the column/feature datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height           float64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [29]:
# Then perform a conversion by converting our column/feature 
# through the use of the apply() function, passing the numerical 
# type provided by numpy.
# To get an understanding of other datatypes provided by numpy we can visit: 
# https://docs.scipy.org/doc/numpy/user/basics.types.html
# ---
# Other 
# ---
# 
df['height'] = df['height'].apply(np.int64)

# Let's now check whether our conversion happened by checking our updated datatypes
# ---
# 
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

#### <font color="green">Challenges</font>

In [46]:
# Challenge 1
# ---
# Question: Convert the variables account_a and account_b to integer datatype.
# ---
# Hint: You can refer to the df dataframe in the example. 
# ---
# OUR CODE GOES BELOW
df.dropna()
df['account_a'] = df['account_a'].astype(np.float).astype("Int64")
df['account_b'] = df['account_b'].apply(np.int64)
df.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a          Int64
account_b          int64
total_account      int64
dtype: object

In [48]:
# Challenge 2
# ---
# Question: Convert the given weight feature in the dataset from pounds to grams. 
# ---
# Hint: 1 pound = 453.592 grams 
#     : You can refer to the df dataframe in the example. 
# ---
# ---
# OUR CODE GOES BELOW
#
df['weight'] = df['weight'] * 453.592
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   lisbon      ...      4340           6730
1          John Paul   london     ...     34334          38834
2        Cindy Jules   stockholm  ...      5504           8949
3      Arthur Kegels    brussels  ...      8999            300
4      Freya Bismark      berlin  ...     19000          26000

[5 rows x 8 columns]

## 4. Syntax Errors

#### <font color="blue">Examples</font>

In [61]:
# Example 1
# --- 
# While performing our analysis, we can get to a point where we need to 
# fix spelling mistakes or typos. This example will show us how we can 
# go about this.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 
df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
df.columns
df.columns = ['name', 'city', 'country', 'height', 'weight', 'account_a', 'account_b', 'total_account']
df.columns
# Let's replacing any value "GERMANYY" with the correct value "GERMANY".
# We use the string replace() function to perform our operation as shown.
# ---
# 
df['country'] = df['country'].str.replace('GERMANYY', 'GERMANY')
df.head()

                name        city  ... account_b  total_account
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [62]:
# Example 2
# ---
# We can also decide to strip or remove leading spaces (space infront) 
# and trailing spaces (spaces at the end) by using the string strip() function
# covered in this example.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# We first load our dataframe column with the intention to observing leading 
# and trailing spaces in the city column
# ---
# 
df['city']

0           LISBON
1            LONDON
2            Stockholm
3             BRUSSELS
4               Berlin
5         Brasilia
6            Stockholm
7            LONDON
Name: city, dtype: object

In [63]:
# Then later we strip the leading and trailing spaces as shown and lastly 
# confirm our changes  
# ---
# 
df['city'] = df['city'].str.strip()
df['city']

0       LISBON
1       LONDON
2    Stockholm
3     BRUSSELS
4       Berlin
5     Brasilia
6    Stockholm
7       LONDON
Name: city, dtype: object

#### <font color="green">Challenges</font>

In [73]:
# Challenge 1
# ---
# Question: Deal with the leading and trailing whitespaces from Name 
# and Team variables in the following dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
#  
df = pd.read_csv('http://bit.ly/NBABasketballDataset')
# df.dtypes
df['Team'] = df['Team'].str.strip()
df['Team']

0      Boston Celtics
1      Boston Celtics
2      Boston Celtics
3       oston Celtics
4      Boston Celtics
            ...
453         Utah Jazz
454         Utah Jazz
455         Utah Jazz
456         Utah Jazz
457               NaN
Name: Team, Length: 458, dtype: object

## 5. Irrelevant Data

#### <font color="blue">Examples</font>

In [75]:
# Example 1
# --- 
# We can also deleting/dropping irrelevant columns/features. 
# By irrelevant we mean dataset features that we don't need 
# to answer a research question. 
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# Hint: Use the df dataframe you created earlier
# ---
# OUR CODE GOES BELOW

df = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')
df.head()

                NAME        CITY  ... ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako   LISBON      ...      4340           6730
1          John Paul   LONDON     ...     34334          38834
2        Cindy Jules   Stockholm  ...      5504           8949
3      Arthur Kegels    BRUSSELS  ...      8999            300
4      Freya Bismark      Berlin  ...     19000          26000

[5 rows x 8 columns]

In [76]:
# Deleting an Irrelevant Column i.e. if we didn't require the column city 
# to answer our research question.
# ---
# While dropping/deleting those two columns:
# a) We set axis = 1
#    A dataframe has two axes: axis 0 and axis 1. 
#    axis 0 represents rows and axis 1 represents columns.
# b) We can also set Inplace = True.
#    This means the changes would be made to the original dataframe.
# Dropping the irrelevant columns i.e. Team and Weight
# Those values were dropped since axis was set equal to 1 and 
# the changes were made in the original data frame since inplace was True.
# 
df.drop(["CITY"], axis = 1, inplace = True) 
 
# And preview our resulting dataset
# ---
# 
df.head()

                NAME         COUNTRY  ...  ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako    PORTUGAL       ...       4340           6730
1          John Paul  UNITED KINGDOM  ...      34334          38834
2        Cindy Jules          Sweden  ...       5504           8949
3      Arthur Kegels         BELGIUM  ...       8999            300
4      Freya Bismark        GERMANYY  ...      19000          26000

[5 rows x 7 columns]

In [77]:
# We can drop multiple columns as shown
# ---
# 
df.drop(["HEIGHT", "WEIGHT"], axis = 1, inplace = True) 

# And preview our resulting dataset 
# --- 
# 
df.head()

                NAME         COUNTRY  ACCOUNT A  ACCOUNT B  TOTAL ACCOUNT
0          Adi Dako    PORTUGAL          2390.0       4340           6730
1          John Paul  UNITED KINGDOM     4500.0      34334          38834
2        Cindy Jules          Sweden        NaN       5504           8949
3      Arthur Kegels         BELGIUM     4344.0       8999            300
4      Freya Bismark        GERMANYY     7000.0      19000          26000

In [78]:
# Example 2
# ---
# We can also fix in-record & cross-datasets errors. 
# These kinds errors result from having two or more values in the same row 
# or across datasets contradicting with each other.
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 
df['total_account_2'] = df['ACCOUNT A'] + df['ACCOUNT B']

# Previewing our resulting dataframe 
# ---
#
df.head()

                NAME         COUNTRY  ...  TOTAL ACCOUNT  total_account_2
0          Adi Dako    PORTUGAL       ...           6730           6730.0
1          John Paul  UNITED KINGDOM  ...          38834          38834.0
2        Cindy Jules          Sweden  ...           8949              NaN
3      Arthur Kegels         BELGIUM  ...            300          13343.0
4      Freya Bismark        GERMANYY  ...          26000          26000.0

[5 rows x 6 columns]

In [80]:
# Create another column to tell us whether if the two columns match.
# We will use the numpy library through use of np.
# ---
# 
df['TOTAL ACOUNT?'] = np.where(df['TOTAL ACCOUNT'] == df['total_account_2'], 'True', 'False')

# Previewing our resulting dataframe 
# ---
# 
df.head()

                NAME         COUNTRY  ...  total_account_2  TOTAL ACOUNT?
0          Adi Dako    PORTUGAL       ...           6730.0           True
1          John Paul  UNITED KINGDOM  ...          38834.0           True
2        Cindy Jules          Sweden  ...              NaN          False
3      Arthur Kegels         BELGIUM  ...          13343.0          False
4      Freya Bismark        GERMANYY  ...          26000.0           True

[5 rows x 7 columns]

In [83]:
# Let's now select the records which don't match 
# ---
# 
df.loc[df['TOTAL ACOUNT?'] == "False"]

                NAME  COUNTRY  ...  total_account_2  TOTAL ACOUNT?
2        Cindy Jules   Sweden  ...              NaN          False
3      Arthur Kegels  BELGIUM  ...          13343.0          False
5         Rena Filip   BRAZIL  ...           8998.0          False

[3 rows x 7 columns]

In [84]:
# At this point we can do several things
# 1. Correct the values,
# 2. Drop/Delete the values,
# 3. Or even decide to leave them as they are for certain reasons
# ---
# If we had a large dataset, we could get the no. of records using len(),
# this would help us in our decision making process.
# ---
# 
len(df.loc[df['TOTAL ACOUNT?'] == "False"])

3

#### <font color="green">Challenges</font>

In [88]:
# Challenge 1
# ---
# Question: While perfoming some analysis to answer a research question, 
# we realize that we don't need the Date and Time features in our dataset. 
# Let's drop those two features below
# ---
# Dataset url = https://bit.ly/SuperMarketSalesDB
# ---
# OUR CODE GOES BELOW

df = pd.read_csv('https://bit.ly/SuperMarketSalesDB')
df.columns
df.drop(["Date", "Time"], axis = 1, inplace = True) 
df.head()

    Invoice ID Branch       City  ... gross margin percentage gross income Rating
0  750-67-8428      A     Yangon  ...                4.761905      26.1415    9.1
1  226-31-3081      C  Naypyitaw  ...                4.761905       3.8200    9.6
2  631-41-3108      A     Yangon  ...                4.761905      16.2155    7.4
3  123-19-1176      A     Yangon  ...                4.761905      23.2880    8.4
4  373-73-7910      A     Yangon  ...                4.761905      30.2085    5.3

[5 rows x 15 columns]

## 6. Duplicates

#### <font color="blue">Examples</font>

In [89]:
# Example 1
# --- 
# Finding duplicate records
# -> Duplicate records are repeated records in a dataset.
# ---
# Dataset url = http://bit.ly/NBABasketballDataset
# ---
# OUR CODE GOES BELOW
# 

nba_df = pd.read_csv('http://bit.ly/NBABasketballDataset')
 
# Again, we first explore our dataset by determining the shape of 
# our dataset (records/instances, columns/variables)
# ---
# 
nba_df.shape

(458, 9)

In [90]:
# We can then identify which observations are duplicates
# through the duplicated() function and sum() to know how many
# duplicate records there are.
# Normally, duplicate records are dropped from the dataset.
# But in our case we don't have any duplicate records.
# ---
#
nba_df = nba_df[nba_df.duplicated()]

In [91]:
# Finding the no. of duplicates
# ---
# 
sum(nba_df.duplicated())

0

In [92]:
# Example 2
# ---
# Dropping duplicate columns
# ---
# Dataset = http://bit.ly/DataCleaningDataset
# ---
# OUR CODE GOES BELOW
# 

# In our previous dataset, if there were duplicates we
# could have dropped the through the use of the drop_duplicates() function 
# as shown in this example 
# ---
# 
nba_df_duplicates = nba_df.drop_duplicates()

In [99]:
# Example 3
# ---
# Dropping duplicates in a specific column in thed df dataframe
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# ---
#

# We can also consider records with repeated variables/columns 
# as duplicates and deal with them. For example, we can 
# identify duplicates in our dataset based on country.
# ---
#  
df.duplicated

# duplicates_df = df[df.duplicated(['country'])]
# duplicates_df

<bound method DataFrame.duplicated of       Invoice ID Branch  ... gross income Rating
0    750-67-8428      A  ...      26.1415    9.1
1    226-31-3081      C  ...       3.8200    9.6
2    631-41-3108      A  ...      16.2155    7.4
3    123-19-1176      A  ...      23.2880    8.4
4    373-73-7910      A  ...      30.2085    5.3
..           ...    ...  ...          ...    ...
995  233-67-5758      C  ...       2.0175    6.2
996  303-96-2227      B  ...      48.6900    4.4
997  727-02-1313      A  ...       1.5920    7.7
998  347-56-2442      A  ...       3.2910    4.1
999  849-09-3807      A  ...      30.9190    6.6

[1000 rows x 15 columns]>

In [ ]:
# Then dropping the duplicates as shown below.
# NB: We will create in a new dataframe object which will contain our unique dataframe
# which won't have any duplicates.
# --- 
# 
unique_df = df.drop_duplicates(['country'])

# Determining the size of our new dataset 
# We note that the two records were dropped from our original dataset
# ---
# 
unique_df.shape

#### <font color="green">Challenges</font>

In [103]:
# Challenge 1
# ---
# Question: Find the duplicates in the following dataset.
# ---
# Dataset url = https://bit.ly/ShoprityDS 
# ---
# OUR CODE GOES BELOW
# 

df = pd.read_csv('https://bit.ly/ShoprityDS')
df_duplicates = df[df.duplicated()]
sum(df.duplicated())
# df.shape

6

In [ ]:
# Challenge 2
# ---
# Question: From your understanding of the features, deal with the duplicates found in the given dataset.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 7. Missing Data

#### <font color="blue">Examples</font>

In [104]:
# Example 3a
# ---
# Checking for missing data
# NB: This method may not be the most convenient. Why? 
# --- 
# We can check if there is any missing values in the entire dataframe as shown 
# ---
# OUR CODE GOES BELOW
# 
df.isnull()

      Item_Identifier  Item_Weight  ...  Outlet_Location_Type  Item_Outlet_Sales
0               False        False  ...                 False              False
1               False        False  ...                 False              False
2               False        False  ...                 False              False
3               False        False  ...                 False              False
4               False        False  ...                 False              False
...               ...          ...  ...                   ...                ...
8524            False        False  ...                 False              False
8525            False        False  ...                 False              False
8526            False        False  ...                 False              False
8527            False        False  ...                 False              False
8528            False        False  ...                 False              False

[8529 rows x 11 columns]

In [105]:
# Example 3b
# --- 
# We can also check for missing values in each column 
# ---
# OUR CODE GOES BELOW
#
df.isnull().any()

Item_Identifier              False
Item_Weight                   True
Item_Fat_Content             False
Item_Visibility               True
Item_Type                    False
Item_MRP                      True
Outlet_Identifier            False
Outlet_Establishment_Year    False
Outlet_Size                   True
Outlet_Location_Type         False
Item_Outlet_Sales            False
dtype: bool

In [106]:
# Example 3c
# ---
# We can check how many missing values there are across each column by 
# ---
# OUR CODE GOES BELOW
#
df.isnull().sum()

Item_Identifier                 0
Item_Weight                  1463
Item_Fat_Content                0
Item_Visibility                 1
Item_Type                       0
Item_MRP                        2
Outlet_Identifier               0
Outlet_Establishment_Year       0
Outlet_Size                  2411
Outlet_Location_Type            0
Item_Outlet_Sales               0
dtype: int64

In [ ]:
# Example 3d
# ---
# We can also check to see if we have any missing values in the dataframe  
# ---
# OUR CODE GOES BELOW
#
print(df.isnull().values.any())

In [ ]:
# Example 3e: Method 1
# ---
# Dealing with the missing data
# ---
# OUR CODE GOES BELOW
# 

# We can drop the missing observations 
# ---
#
df_no_missing = df.dropna()

# Checking for missing data
df_no_missing.isnull().sum()

In [ ]:
# Example 3e: Method 2
# ---
# We can drop rows where all cells in that row is NA
# ---
# OUR CODE GOES BELOW
# 
df_cleaned = df.dropna(how='all')

# Checking the shape of our dataset
df_cleaned.shape

In [ ]:
# Example 3e: Method 3
# ---
# We could drop columns if they only contain missing values
# ---
# OUR CODE GOES BELOW
# 
df_without_columns = df.dropna(axis=1, how='all')

# Checking the shape of our dataset
df_without_columns.shape

In [ ]:
# Example 3e: Method 4
# ---
# We could drop rows that contain less than five observations
# ---
# OUR CODE GOES BELOW
# 
df.dropna(thresh=5)

# Checking the shape of our dataset
df.shape


# Further reading
# ----
# Above are only a few methods of dealing with missing data.

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 3a
# ---
# Question: Find the missing values in the following datset.
# You can use any of the above methods to you see fit.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---  
# OUR CODE GOES BELOW
#

In [ ]:
# Challenge 3b
# ---
# Question: Handle the missing values in the following dataset.
# You can any of the above methods that you see fit.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 8. Filtering

#### <font color="blue">Examples & Challenges</font>

In [ ]:
# Example 4a
# ---
# Selecting rows when columns contain certain values
# ---
# NB: Selecting records where petal_length is 5.0 
# ---
# OUR CODE GOES BELOW
# 

# Reading our csv file from the given url and storing it to a dataframe.
iris_df = pd.read_csv("http://bit.ly/IrisDataset")

# Previewing the first 5 records
iris_df.head()

In [ ]:
# Selecting the records where column has certain values 
# ---
#
iris_df[iris_df.petal_length.isin(['5.0'])]

In [ ]:
# Challenge 4a
# ---
# Question: From the given dataset, find observations with outlets
# established in 2002.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Example 4b
# ---
# Selecting the records where column doesn't have certain values 
# in our case, where petal_leghth is not 5.0
# ---
# OUR CODE GOES BELOW
# 

iris_df[~iris_df.petal_length.isin(['5.0'])]

In [ ]:
# Challenge 4b
# ---
# Question: Select all the Dairy observations from the given dataset.
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Example 4c
# ---
# Selecting records using filters where petal_width greater than 1.9
# ---
# OUR CODE GOES BELOW
# 

iris_df[(iris_df['petal_width'] > 1.9)]

In [ ]:
# Challenge 4c
# ---
# Question: Which observations had items outlet sales greater than 2000?
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Example 5d
# ---
# We can also use the query method to get for data where petal_width is equal to 1.0
# Once you run this cell, replace the equals operator == to with less than < 
# or greater than > operators to see their applications as well.
# ---
# The parameter inplace makes changes in the original dataframe if True.
# We should also note the query method works if the column name doesnt have any empty spaces.
# Hence the need replace blank spaces in our column names with '_'
# ---
#  

# Let's filter our data
#
iris_df.query('petal_width == 1.9', inplace = True) 

# Previewing our dataset 
iris_df.head()

In [ ]:
# We can also perform multiple condition filtering as shown below
# ---
#

iris_df.query('sepal_width == 2.7 and petal_length == 5.1', inplace = True) 

# Previewing our dataset 
iris_df.head()

In [ ]:
# Challenge 5d
# ---
# Question: Which observations had items outlet sales greater than 2000 and less than 3000?
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 9. Sorting

#### <font color="blue">Examples</font>

In [ ]:
# Example 5a
# --- 
# Load the given dataframe in ascending order by reports 
# ---
# OUR CODE GOES BELOW
# 
 
# Sorting our dataset in ascending order by sepal_length
# ---
# 
iris_df.sort_values(by='sepal_length', ascending=1)

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 5a 
# --- 
# Sort items by weight in descending order given the following dataset.
# Hint: ascending = 0 
# ---
# Dataset url = https://bit.ly/ShoprityDS
# ---
# OUR CODE GOES BELOW
#

## 10. Splitting, Merging and Concatenation

#### <font color="blue">Examples & Challenges</font>

In [ ]:
# Example 6a
# --- 
# Split the dataframe species column into two columns by using the "-" character
# ---
# OUR CODE GOES BELOW
# 
 
# Dropping null value columns to avoid errors 
iris_df.dropna(inplace = True) 
  
# New data frame with split value columns 
new_iris_df = iris_df["species"].str.split("-", n = 1, expand = True) 
  
# Naking separate first name column from new data frame 
iris_df["family"]= new_iris_df[0] 
  
# Making separate last name column from new data frame 
iris_df["sub-species"]= new_iris_df[1] 
  
# Dropping old Name columns 
iris_df.drop(columns =["species"], inplace = True) 
  
# Displaying our dataframe
iris_df

In [ ]:
# Example 2
# ---
# Concatenating (merging) two columns in a dataframe
# ---  
# OUR CODE GOES BELOW
# 

# Concatenating our column
# 
iris_df['species'] = iris_df['family'].str.cat(iris_df['sub-species'],sep="-")

# Dropping old name columns 
#
iris_df.drop(columns = ["family", "sub-species"], inplace = True) 

# Previewing our new dataframe
#
iris_df.head()

In [ ]:
# Challenge 6a
# --- 
# Concatenate the the city and state columns from the dataset below. 
# The resulting region column should have city and state seperated by a comma and whitespace.
# ---
# Dataset url = http://bit.ly/SchoolShootingsDataset
# ---
# Step 1: Load the dataset
# Step 2: Preview the dataset 
# Step 3: Perform your concatenation
# Step 4: Dropping old columns
# Step 4: Preview your final dataframe
# ---
# OUR CODE GOES BELOW
#

In [ ]:
# Example 6b
# ---
# Merging two dataframes. 
# In this example, we will create two simple dataframes for demonstration purposes.
# ---  
# OUR CODE GOES BELOW
# 

# Let's create our first dataframe and preview it
# 
df1 = pd.DataFrame([[2, 3], [41, 51]], columns=['a', 'b'])
df1.head()

In [ ]:
 # Let our second dataframe and preview it
#
df2 = pd.DataFrame([[2, 5], [41, 6]], columns=['a', 'c'])
df2.head()

In [ ]:
# Merging our dataframes and storing our resulting dataframe in df3, then previewing it 
# 
df3 = df1.merge(df2, how='left', on='a') 
df3.head()

In [ ]:
# Challenge 6b
# --- 
# Merge the following two datasets
# ---
# Dataset 1 url = http://bit.ly/CitiesDataset
# Dataset 2 url = http://bit.ly/CountriesDataset1
# ---
# OUR CODE GOES BELOW
#

## 11. Outliers

#### <font color="blue">Examples</font>

In [ ]:
# Example 1
# --- 
# Given the following dataset, find and deal with outliers.
# ---
# Dataset url = http://bit.ly/CountryDataset1
# ---
# OUR CODE GOES BELOW
#  

# Let's read data from url as dataframe
# 
outliersc_df = pd.read_csv("http://bit.ly/CountryDataset1") 

# Lets preview our our dataframe below
#
outliersc_df.head()

In [ ]:
# Checking the size of our dataset for cleaning purposes
# ---
#
outliersc_df.shape

In [ ]:
# There are many ways of dealing with the outliers however in this session we wiil 
# use the interquartile range (IQR). 
# A data point is considered to be an outiler if it is more 
# than 1.5 * IQR above the third quartile (i.e. Q3  + 1.5 * IQR) 
# or below the first quartile (i.e. Q1 - 1.5 * IQR). 
# If we were to use a box plot visualisation then,
# we would be able to visually see those values outside this range. 
# Something to note is that this method will consider only the numerical values in 
# our dataset. Lets now calculate the IQR for each column.
# ---
#

# We first defining our quantiles using the quantile() function
# ---
# 
Q1 = outliersc_df.quantile(0.25)
Q3 = outliersc_df.quantile(0.75)
IQR = Q3 - Q1
IQR

# Then filtering out our outliers by getting values which are outside our IQR Range.
# ---
#
outliers_df_iqr = outliersc_df[((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of the dataset with outliers for cleaning purposes
# ---
#
outliers_df_iqr.shape

In [ ]:
# We can also explore our outliers by doing the following
# ---
# 
outliers_df_iqr

In [ ]:
# Lastly, the most common method of handling our outliers is to drop them.
# In some cases we can:
# 1. Leave them if they are genuine
# 2. Replace them with values within the IQR range
# 3. Drop them
# ---
# In our case, we will drop them.
# We just use the "~" character to refer to the other part of the dataset that 
# does not have outliers
# ---
# 
clean_dfc_iqr = outliersc_df[~((outliersc_df < (Q1 - 1.5 * IQR)) | (outliersc_df > (Q3 + 1.5 * IQR))).any(axis=1)]

# Checking the size of our final dataset.
clean_dfc_iqr.shape

#### <font color="green">Challenges</font>

In [ ]:
# Challenge 1
# ---
# Question: Find and Deal with the outliers in the given df dataframe.
# ---
# Dataset url = http://bit.ly/DataCleaningDataset
# You can use the df dataframe you created ealier on.
# ---
# OUR CODE GOES BELOW
#

## 12. Exporting Data

#### <font color="blue">Examples & Challenges</font>

In [ ]:
# Pre-requisite 7
# ---
# Importing files module 
# ---
# OUR CODE GOES BELOW
#  

# Files module will allow us to download our file from colaboratory
from google.colab import files

In [ ]:
# Example 7a
# --- 
# Load the given dataframe in ascending order by reports 
# ---
# OUR CODE GOES BELOW
# 
  
# Create our sample dataframe
data = {'name': ['Daniel', 'Joyce', 'Elizabeth', 'Sanni', 'Sefu'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Nairobi', 'Cairo', 'Cape Town', 'Adis Ababa', 'Mombasa'])
df.head()

In [ ]:
# Exporting our sample dataframe as a csv
# ---
# 
 
df.to_csv('example.csv') 

# NB: In order to download our files from colaboratory we need to run the following
#
files.download('example.csv')

In [ ]:
# Challenge 7a
# ---
# Question: Export a csv file of your resulting shoprity dataframe below 
# --- 
# OUR CODE GOES BELOW
#

In [ ]:
# Example 7b
# ---
# Exporting our sample dataframe as a excel file (xlsx)
# --- 
# ---
# OUR CODE GOES BELOW
#  

df.to_excel('example.xlsx') 

# NB: In order to download our files from colab we need to run the following
#
files.download('example.xlsx')

In [ ]:
# Challenge 7b
# ---
# Question: Export a excel file of your resulting shoprity dataframe
# --- 
# OUR CODE GOES BELOW
#